app/Models/GeneralModel.php

SELECT *
FROM `menu`
WHERE `section` = 'admin'
AND `parent` = 0
AND `display` = '1'
ORDER BY `sort`
---
    public function getMenu($section= "public",$parent= 0){
        $q= $this->db->table("menu")->where(["section"=>$section,"parent"=>$parent,"display"=>'1'])->orderBy("sort")->get();

SELECT *
FROM `edLevels`
ORDER BY `sort`
---
    public function getEdLevelList():array{
        $q= $this->db->table("edLevels")->orderBy("sort")->get();

SELECT *
FROM `edForms`
ORDER BY `sort`
---
    public function getEdFormList():array{
        $q= $this->db->table("edForms")->orderBy("sort")->get();

SELECT *
FROM `edTypes`
---
    public function getEdTypeList():array{
        $q= $this->db->table("edTypes")->get();

SELECT *
FROM `edProfiles`
---
    public function getEdProfileList():array{
        $q= $this->db->table("edProfiles")->get();

SELECT *
FROM `examSubjects`
---
    public function getExamSubjectsList(){
        $q= $this->db->table("examSubjects")->get();